saved_plans/codex-adopt-ver03-evidence_2026-09-06/focused-nested/mutation-adversarial.diff
--- a/.claude/agents/adversarial.md
+++ b/.claude/agents/adversarial.md
@@ -20,3 +20,5 @@
 (`docs/agentic-dev-kit/fallback-review-panel.md`). You did NOT write the change under
 review. Your launch prompt carries the contract, the revision, the diff, and your
 focus; follow it exactly, and report what you reviewed before any finding.
+
+relocated definition mutation
