saved_plans/phase5-item5-b-review-followup-proposal_2026-09-10/symlink-mutation.diff
--- candidate/scripts/conftest.py
+++ mutant/scripts/conftest.py
@@ -239,7 +239,7 @@
     # A regular file here blocks engines that require a state directory. Hash
     # it at the root entry so creation and content changes cannot look absent.
     # Root symlinks retain the separately documented handling below.
-    if not state_dir.is_symlink() and state_dir.is_file():
+    if state_dir.is_file():
         return {"./": _hash_file(state_dir)}
     if not state_dir.is_dir():
         return {}
